app/Controllers/CTask.php

INSERT INTO `t_tasks` (`title`, `description`, `id_category`, `id_status`) VALUES ('Nueva prueba', 'Git me esta costando un poco', '0', '0')
---
    public function save(){
        $task = new Mtask();
        $datos = $this->request->getVar();

        if(!$task->save($datos)){

SELECT *
FROM `t_tasks`
WHERE `id_task` = '1'
 LIMIT 1
---
    public function edit($id = null){
        $task = new Mtask();
        $datos['task'] = $task->where('id_task',$id)->first();