app/Models/MTask.php

SELECT *
FROM `t_tasks`
---
    public function getTasks(){
        $task = $this->db->table('t_tasks');
        return $task->get()->getResultArray();